Revit 2024 API
ViewDuplicateOption Enumeration
 Options for duplicating views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum ViewDuplicateOption
Visual Basic
Public Enumeration ViewDuplicateOption
Visual C++
public enum class ViewDuplicateOption
Members
Member name | Description
Duplicate |  Duplicate view
AsDependent |  Duplicate as Dependent
WithDetailing |  Duplicate with Detailing
See Also
Autodesk.Revit.DB Namespace